Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/mengzi__all__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 萬章問曰：「舜往于田，號泣于旻天。何為其號泣也？」孟子曰：「怨慕也。」萬章曰：「父母愛之，喜而不忘；父母惡之，勞而不怨。然則舜怨乎？」曰：「長息問於公明高曰：『舜往于田，則吾既得聞命矣；號泣于旻天、于父母，則吾不知也。』公明高曰：『是非爾所知也。』夫公明高以孝子之心為不若是恝。『我竭力耕田，共為子職而已矣；父母之不我愛，於我何哉？』帝使其子九男二女，百官牛羊倉廩備，以事舜於畎畝之中。天下之士多就之者，帝將胥天下而遷之焉。為不順於父母，如窮人無所歸。天下之士悅之，人之所欲也，而不足以解憂。好色，人之所欲；妻帝之二女，而不足以解憂。富，人之所欲；富有天下，而不足以解憂。貴，人之所欲；貴為天子，而不足以解憂。人悅之、好色、富貴無足以解憂者，惟順於父母，可以解憂。人少則慕父母，知好色則慕少艾，有妻子則慕妻子，仕則慕君，不得於君則熱中。大孝終身慕父母，五十而慕者，予於大舜見之矣。」
en: Wan Zhang asked Mencius, saying, 'When Shun went into the fields, he cried out and wept towards the pitying heavens. Why did he cry out and weep?' Mencius replied, 'He was dissatisfied, and full of earnest desire.' Wan Zhang said, 'When his parents love him, a son rejoices and forgets them not. When his parents hate him, though they punish him, he does not murmur. Was Shun then murmuring against his parents?' Mencius answered, 'Chang Xi asked Gong Ming Gao, saying, "As to Shun's going into the fields, I have received your instructions, but I do not know about his weeping and crying out to the pitying heavens and to his parents." Gong Ming Gao answered him, "You do not understand that matter." Now, Gong Ming Gao supposed that the heart of the filial son could not be so free of sorrow. Shun would say, "I exert my strength to cultivate the fields, but I am thereby only discharging my office as a son. What can there be in me that my parents do not love me?" The Di caused his own children, nine sons and two daughters, the various officers, oxen and sheep, storehouses and granaries, all to be prepared, to serve Shun amid the channelled fields. Of the scholars of the kingdom there were multitudes who flocked to him. The sovereign designed that Shun should superintend the kingdom along with him, and then to transfer it to him entirely. But because his parents were not in accord with him, he felt like a poor man who has nowhere to turn to. To be delighted in by all the scholars of the kingdom, is what men desire, but it was not sufficient to remove the sorrow of Shun. The possession of beauty is what men desire, and Shun had for his wives the two daughters of the Di, but this was not sufficient to remove his sorrow. Riches are what men desire, and the kingdom was the rich property of Shun, but this was not sufficient to remove his sorrow. Honours are what men desire, and Shun had the dignity of being sovereign, but this was not sufficient to remove his sorrow. The reason why the being the object of men's delight, with the possession of beauty, riches, and honours were not sufficient to remove his sorrow, was that it could be removed only by his getting his parents to be in accord with him. The desire of the child is towards his father and mother. When he becomes conscious of the attractions of beauty, his desire is towards young and beautiful women. When he comes to have a wife and children, his desire is towards them. When he obtains office, his desire is towards his sovereign - if he cannot get the regard of his sovereign, he burns within. But the man of great filial piety, to the end of his life, has his desire towards his parents. In the great Shun I see the case of one whose desire at fifty year's was towards them.'

source: 萬章問曰：「《詩》云：『娶妻如之何？必告父母。』信斯言也，宜莫如舜。舜之不告而娶，何也？」孟子曰：「告則不得娶。男女居室，人之大倫也。如告則廢人之大倫以懟父母，是以不告也。」萬章曰：「舜之不告而娶，則吾既得聞命矣。帝之妻舜而不告，何也？」曰：「帝亦知告焉則不得妻也。」萬章曰：「父母使舜完廩，捐階，瞽瞍焚廩。使浚井，出，從而掩之。象曰：『謨蓋都君咸我績。牛羊父母，倉廩父母，干戈朕，琴朕，弤朕，二嫂使治朕棲。』象往入舜宮，舜在床琴。象曰：『郁陶思君爾。』忸怩。舜曰：『唯茲臣庶，汝其于予治。』不識舜不知象之將殺己與？」曰：「奚而不知也？象憂亦憂，象喜亦喜。」曰：「然則舜偽喜者與？」曰：「否。昔者有饋生魚於鄭子產，子產使校人畜之池。校人烹之，反命曰：『始舍之圉圉焉，少則洋洋焉，攸然而逝。』子產曰：『得其所哉！得其所哉！』校人出，曰：『孰謂子產智？予既烹而食之，曰：「得其所哉！得其所哉！」』故君子可欺以其方，難罔以非其道。彼以愛兄之道來，故誠信而喜之。奚偽焉？」
en: Wan Zhang asked Mencius, saying, 'It is said in the Book of Poetry, "In marrying a wife, how ought a man to proceed? He must inform his parents." If the rule be indeed as here expressed, no man ought to have illustrated it so well as Shun. How was it that Shun's marriage took place without his informing his parents?' Mencius replied, 'If he had informed them, he would not have been able to marry. That male and female should dwell together, is the greatest of human relations. If Shun had informed his parents, he must have made void this greatest of human relations, thereby incurring their resentment. On this account, he did not inform them!' Wan Zhang said, 'As to Shun's marrying without informing his parents, I have heard your instructions; but how was it that the Di Yao gave him his daughters as wives without informing Shun's parents?' Mencius said, 'The Di also knew that if he informed them, he could not marry his daughters to him.' Wan Zhang said, 'His parents set Shun to repair a granary, to which, the ladder having been removed, Gu Sou set fire. They also made him dig a well. He got out, but they, not knowing that, proceeded to cover him up. Xiang said, "Of the scheme to cover up the city-forming prince, the merit is all mine. Let my parents have his oxen and sheep. Let them have his storehouses and granaries. His shield and spear shall be mine. His lute shall be mine. His bow shall be mine. His two wives I shall make attend for me to my bed." Xiang then went away into Shun's palace, and there was Shun on his couch playing on his lute. Xiang said, "I am come simply because I was thinking anxiously about you." At the same time, he blushed deeply. Shun said to him, "There are all my officers - do you undertake the government of them for me." I do not know whether Shun was ignorant of Xiang's wishing to kill him.' Mencius answered, 'How could he be ignorant of that? But when Xiang was sorrowful, he was also sorrowful; when Xiang was joyful, he was also joyful.' Zhang said, 'In that case, then, did not Shun rejoice hypocritically?' Mencius replied, 'No. Formerly, some one sent a present of a live fish to Zi Chan of Zhang. Zi Chan ordered his pond-keeper to keep it in the pond, but that officer cooked it, and reported the execution of his commission, saying, "When I first let it go, it embarrassed. In a little while, it seemed to be somewhat at ease, then it swam away joyfully." Zi Chan observed, "It had got into its element! It had got into its element!" The pond-keeper then went out and said, "Who calls Zi Chan a wise man? After I had cooked and eaten the fish, he says, "It had got into its element! It had got into its element!" Thus a superior man may be imposed on by what seems to be as it ought to be, but he cannot be entrapped by what is contrary to right principle. Xiang came in the way in which the love of his elder brother would have made him come; therefore Shun sincerely believed him, and rejoiced. What hypocrisy was there?'

source: 萬章問曰：「象日以殺舜為事，立為天子，則放之，何也？」孟子曰：「封之也。或曰放焉。」萬章曰：「舜流共工于幽州，放驩兜于崇山，殺三苗于三危，殛鯀于羽山，四罪而天下咸服。誅不仁也。象至不仁，封之有庳。有庳之人奚罪焉？仁人固如是乎？在他人則誅之，在弟則封之。」曰：「仁人之於弟也，不藏怒焉，不宿怨焉，親愛之而已矣。親之，欲其貴也；愛之，欲其富也。封之有庳，富貴之也。身為天子，弟為匹夫，可謂親愛之乎？」「敢問『或曰放』者何謂也？」曰：「象不得有為於其國，天子使吏治其國，而納其貢稅焉，故謂之放。豈得暴彼民哉？雖然，欲常常而見之，故源源而來。『不及貢，以政接于有庳』，此之謂也。」
en: Wan Zhang said, 'Xiang made it his daily business to slay Shun. When Shun was made sovereign, how was it that he only banished him?' Mencius said, 'He raised him to be a prince. Some supposed that it was banishing him?' Wan Zhang said, 'Shun banished the superintendent of works to You Zhou; he sent away Huan Dou to the mountain Chong; he slew the prince of San Miao in San Wei; and he imprisoned Gun on the mountain Yu. When the crimes of those four were thus punished, the whole kingdom acquiesced - it was a cutting off of men who were destitute of benevolence. But Xiang was of all men the most destitute of benevolence, and Shun raised him to be the prince of You Bei - of what crimes had the people of You Bei been guilty? Does a benevolent man really act thus? In the case of other men, he cut them off; in the case of his brother, he raised him to be a prince.' Mencius replied, 'A benevolent man does not lay up anger, nor cherish resentment against his brother, but only regards him with affection and love. Regarding him with affection, he wishes him to be honourable: regarding him with love, he wishes him to be rich. The appointment of Xiang to be the prince of You Bei was to enrich and ennoble him. If while Shun himself was sovereign, his brother had been a common man, could he have been said to regard him with affection and love?' Wan Zhang said, 'I venture to ask what you mean by saying that some supposed that it was a banishing of Xiang?' Mencius replied, 'Xiang could do nothing in his State. The Son of Heaven appointed an officer to administer its government, and to pay over its revenues to him. This treatment of him led to its being said that he was banished. How indeed could he be allowed the means of oppressing the people? Nevertheless, Shun wished to be continually seeing him, and by this arrangement, he came incessantly to court, as is signified in that expression: "He did not wait for the rendering of tribute, or affairs of government, to receive the prince of You Bei.

source: 咸丘蒙問曰：「語云：『盛德之士，君不得而臣，父不得而子。』舜南面而立，堯帥諸侯北面而朝之，瞽瞍亦北面而朝之。舜見瞽瞍，其容有蹙。孔子曰：『於斯時也，天下殆哉，岌岌乎！』不識此語，誠然乎哉？」孟子曰：「否，此非君子之言，齊東野人之語也。堯老而舜攝也，《堯典》曰：『二十有八載，放勛乃徂落，百姓如喪考妣。三年，四海遏密八音。』孔子曰：『天無二日，民無二王。』舜既為天子矣，又帥天下諸侯以為堯三年喪，是二天子矣。」咸丘蒙曰：「舜之不臣堯，則吾既得聞命矣。《詩》云：『普天之下，莫非王土；率土之濱，莫非王臣。』而舜既為天子矣，敢問瞽瞍之非臣，如何？」曰：「是詩也，非是之謂也，勞於王事而不得養父母也。曰：『此莫非王事，我獨賢勞也。』故說詩者，不以文害辭，不以辭害志；以意逆志，是為得之。如以辭而已矣。《雲漢》之詩曰：『周餘黎民，靡有孑遺。』信斯言也，是周無遺民也。孝子之至，莫大乎尊親；尊親之至，莫大乎以天下養。為天子父，尊之至也；以天下養，養之至也。《詩》曰：『永言孝思，孝思惟則』，此之謂也。《書》曰：『祗載見瞽瞍，夔夔齋栗，瞽瞍亦允若』，是為父不得而子也？」
en: Xian Qiu Meng asked Mencius, saying, 'There is the saying, "A scholar of complete virtue may not be employed as a minister by his sovereign, nor treated as a son by his father. Shun stood with his face to the south, and Yao, at the head of all the princes, appeared before him at court with his face to the north. Gu Sou also did the same. When Shun saw Gu Sou, his countenance became discomposed. Confucius said, At this time, in what a perilous condition was the kingdom! Its state was indeed unsettled." - I do not know whether what is here said really took place.' Mencius replied, 'No. These are not the words of a superior man. They are the sayings of an uncultivated person of the east of Qi. When Yao was old, Shun was associated with him in the government. It is said in the Canon of Yao, "After twenty and eight years, the Highly Meritorious one deceased. The people acted as if they were mourning for a father or mother for three years, and up to the borders of the four seas every sound of music was hushed." Confucius said, "There are not two suns in the sky, nor two sovereigns over the people." Shun having been sovereign, and, moreover, leading on all the princes to observe the three years' mourning for Yao, there would have been in this case two sovereigns.' Xian Qiu Meng said, 'On the point of Shun's not treating Yao as a minister, I have received your instructions. But it is said in the Book of Poetry, Under the whole heaven, Every spot is the sovereign's ground; To the borders of the land, Every individual is the sovereign's minister;" - and Shun had become sovereign. I venture to ask how it was that Gu Sou was not one of his ministers.' Mencius answered, 'That ode is not to be understood in that way - it speaks of being laboriously engaged in the sovereign's business, so as not to be able to nourish one's parents, as if the author said, "This is all the sovereign's business, and how is it that I alone am supposed to have ability, and am made to toil in it?" Therefore, those who explain the odes, may not insist on one term so as to do violence to a sentence, nor on a sentence so as to do violence to the general scope. They must try with their thoughts to meet that scope, and then we shall apprehend it. If we simply take single sentences, there is that in the ode called "The Milky Way," - "Of the black-haired people of the remnant of Zhou, There is not half a one left." If it had been really as thus expressed, then not an individual of the people of Zhou was left. Of all which a filial son can attain to, there is nothing greater than his honouring his parents. And of what can be attained to in the honouring one's parents, there is nothing greater than the nourishing them with the whole kingdom. Gu Sou was the father of the sovereign - this was the height of honour. Shun nourished him with the whole kingdom - this was the height of nourishing. In this was verified the sentiment in the Book of Poetry, "Ever cherishing filial thoughts, Those filial thoughts became an example to after ages." It is said in the Book of History, "Reverently performing his duties, he waited on Gu Sou, and was full of veneration and awe. Gu Sou also believed him and conformed to virtue." This is the true case of the scholar of complete virtue not being treated as a son by his father.'

source: 萬章曰：「堯以天下與舜，有諸？」孟子曰：「否，天子不能以天下與人。」「然則舜有天下也，孰與之？」曰：「天與之。」「天與之者，諄諄然命之乎？」曰：「否，天不言，以行與事示之而已矣。」曰：「以行與事示之者，如之何？」曰：「天子能薦人於天，不能使天與之天下；諸侯能薦人於天子，不能使天子與之諸侯；大夫能薦人於諸侯，不能使諸侯與之大夫。昔者堯薦舜於天而天受之，暴之於民而民受之。故曰：天不言，以行與事示之而已矣。」曰：「敢問薦之於天而天受之，暴之於民而民受之，如何？」曰：「使之主祭而百神享之，是天受之。使之主事而事治，百姓安之，是民受之也。天與之，人與之，故曰：天子不能以天下與人。舜相堯，二十有八載，非人之所能為也，天也。堯崩，三年之喪畢，舜避堯之子於南河之南。天下諸侯朝覲者，不之堯之子而之舜；訟獄者，不之堯之子而之舜；謳歌者，不謳歌堯之子而謳歌舜；故曰『天』也。夫然後之中國，踐天子位焉。而居堯之宮，逼堯之子，是『篡』也，非『天與』也。《泰誓》曰：『天視自我民視，天聽自我民聽』，此之謂也。」
en: Wan Zhang said, 'Was it the case that Yao gave the throne to Shun?' Mencius said, 'No. The sovereign cannot give the throne to another.' 'Yes - but Shun had the throne. Who gave it to him?' 'Heaven gave it to him,' was the answer. '" Heaven gave it to him:" - did Heaven confer its appointment on him with specific injunctions?' Mencius replied, 'No. Heaven does not speak. It simply showed its will by his personal conduct and his conduct of affairs.' "It showed its will by his personal conduct and his conduct of affairs" - how was this?' Mencius's answer was, 'The sovereign can present a man to Heaven, but he cannot make Heaven give that man the throne. A prince can present a man to the sovereign, but he cannot cause the sovereign to make that man a prince. A great officer can present a man to his prince, but he cannot cause the prince to make that man a great officer. Yao presented Shun to Heaven, and Heaven accepted him. He presented him to the people, and the people accepted him. Therefore I say, "Heaven does not speak. It simply indicated its will by his personal conduct and his conduct of affairs."' Zhang said, 'I presume to ask how it was that Yao presented Shun to Heaven, and Heaven accepted him; and that he exhibited him to the people, and the people accepted him.' Mencius replied, 'He caused him to preside over the sacrifices, and all the spirits were well pleased with them; thus Heaven accepted him. He caused him to preside over the conduct of affairs, and affairs were well administered, so that the people reposed under him; thus the people accepted him. Heaven gave the throne to him. The people gave it to him. Therefore I said, "The sovereign cannot give the throne to another. Shun assisted Yao in the government for twenty and eight years - this was more than man could have done, and was from Heaven. After the death of Yao, when the three years' mourning was completed, Shun withdrew from the son of Yao to the south of South river. The princes of the kingdom, however, repairing to court, went not to the son of Yao, but they went to Shun. Litigants went not to the son of Yao, but they went to Shun. Singers sang not the son of Yao, but they sang Shun. Therefore I said, "Heaven gave him the throne." It was after these things that he went to the Middle Kingdom, and occupied the seat of the Son of Heaven. If he had, before these things, taken up his residence in the palace of Yao, and had applied pressure to the son of Yao, it would have been an act of usurpation, and not the gift of Heaven. This sentiment is expressed in the words of The Great Declaration: "Heaven sees according as my people see; Heaven hears according as my people hear."'

source: 萬章問曰：「人有言『至於禹而德衰，不傳於賢而傳於子』，有諸？」孟子曰：「否然也。天與賢則與賢，天與子則與子。昔者舜薦禹於天，十有七年；舜崩，三年之喪畢，禹避舜之子於陽城；天下之民從之，若堯崩之後不從堯之子而從舜也。禹薦益於天，七年，禹崩，三年之喪畢，益避禹子於箕山之陰；朝覲訟獄者，不之益而之啟，曰：『吾君之子也。』謳歌者不謳歌益而謳歌啟，曰：『吾君之子也。』丹朱之不肖，舜之子亦不肖；舜之相堯、禹之相舜也，歷年多，施澤於民久。啟賢，能敬承繼禹之道；益之相禹也，歷年少，施澤於民未久。舜、禹、益相去久遠，其子之賢不肖皆天也，非人之所能為也。莫之為而為者，天也；莫之致而至者，命也。匹夫而有天下者，德必若舜禹，而又有天子薦之者；故仲尼不有天下。繼世而有天下，天之所廢，必若桀紂者也；故益、伊尹、周公不有天下。伊尹相湯以王於天下，湯崩，太丁未立，外丙二年，仲壬四年。太甲顛覆湯之典刑，伊尹放之於桐三年；太甲悔過，自怨自艾，於桐處仁遷義，三年以聽伊尹之訓己也，復歸于亳。周公之不有天下，猶益之於夏、伊尹之於殷也。孔子曰：『唐虞禪，夏後、殷、周繼，其義一也。』」
en: Wan Zhang asked Mencius, saying, 'People say, "When the disposal of the kingdom came to Yu, his virtue was inferior to that of Yao and Shun, and he transmitted it not to the worthiest but to his son." Was it so?' Mencius replied, 'No; it was not so. When Heaven gave the kingdom to the worthiest, it was given to the worthiest. When Heaven gave it to the son of the preceding sovereign, it was given to him. Shun presented Yu to Heaven. Seventeen years elapsed, and Shun died. When the three years' mourning was expired, Yu withdrew from the son of Shun to Yang Cheng. The people of the kingdom followed him just as after the death of Yao, instead of following his son, they had followed Shun. Yu presented Yi to Heaven. Seven years elapsed, and Yu died. When the three years' mourning was expired, Yi withdrew from the son of Yu to the north of mount Ji. The princes, repairing to court, went not to Yi, but they went to Qi. Litigants did not go to Yi, but they went to Qi, saying, "He is the son of our sovereign;" the singers did not sing Yi, but they sang Qi, saying, "He is the son of our sovereign. That Dan Zhu was not equal to his father, and Shun's son not equal to his; that Shun assisted Yao, and Yu assisted Shun, for many years, conferring benefits on the people for a long time; that thus the length of time during which Shun, Yu, and Yi assisted in the government was so different; that Qi was able, as a man of talents and virtue, reverently to pursue the same course as Yu; that Yi assisted Yu only for a few years, and had not long conferred benefits on the people; that the periods of service of the three were so different; and that the sons were one superior, and the other superior - all this was from Heaven, and what could not be brought about by man. That which is done without man's doing is from Heaven. That which happens without man's causing is from the ordinance of Heaven. In the case of a private individual obtaining the throne, there must be in him virtue equal to that of Shun or Yu; and moreover there must be the presenting of him to Heaven by the preceding sovereign. It was on this account that Confucius did not obtain the throne. When the kingdom is possessed by natural succession, the sovereign who is displaced by Heaven must be like Jie or Zhou. It was on this account that Yi, Yi Yin, and Zhou Gong did not obtain the throne. Yi Yin assisted Tang so that he became sovereign over the kingdom. After the demise of Tang, Tai Ding having died before he could be appointed sovereign, Wai Bing reigned two years, and Zhong Ren four. Tai Jia was then turning upside down the statutes of Tang, when Yi Yin placed him in Tong for three years. There Tai Jia repented of his errors, was contrite, and reformed himself. In Tong be came to dwell in benevolence and walk in righteousness, during those three years, listening to the lessons given to him by Yi Yin. Then Yi Yin again returned with him to Bo. Zhou Gong not getting the throne was like the case of Yi and the throne of Xia, or like that of Yi Yin and the throne of Yin. Confucius said, "Tang and Yu resigned the throne to their worthy ministers. The sovereign of Xia and those of Yin and Zhou transmitted it to their sons. The principle of righteousness was the same in all the cases."'

source: 萬章問曰：「人有言『伊尹以割烹要湯』，有諸？」孟子曰：「否，不然。伊尹耕於有莘之野，而樂堯舜之道焉。非其義也，非其道也，祿之以天下弗顧也，繫馬千駟弗視也。非其義也，非其道也，一介不以與人，一介不以取諸人。湯使人以幣聘之。囂囂然曰：『我何以湯之聘幣為哉？我豈若處畎畝之中，由是以樂堯舜之道哉？』湯三使往聘之。既而幡然改曰：『與我處畎畝之中，由是以樂堯舜之道，吾豈若使是君為堯舜之君哉？吾豈若使是民為堯舜之民哉？吾豈若於吾身親見之哉？天之生此民也，使先知覺後知，使先覺覺後覺也。予，天民之先覺者也。予將以斯道覺斯民也，非予覺之而誰也？』思天下之民匹夫匹婦有不被堯舜之澤者，若己推而內之溝中。其自任以天下之重如此，故就湯而說之以伐夏救民。吾未聞枉己而正人者也，況辱己以正天下者乎？聖人之行不同也，或遠或近，或去或不去，歸潔其身而已矣。吾聞其以堯舜之道要湯，未聞以割烹也。《伊訓》曰：『天誅造攻自牧宮，朕載自亳。』」
en: Wan Zhang asked Mencius, saying, 'People say that Yi Yin sought an introduction to Tang by his knowledge of cookery. Was it so?' Mencius replied, 'No, it was not so. Yi Yin was a farmer in the lands of the prince of Xin, delighting in the principles of Yao and Shun. In any matter contrary to the righteousness which they prescribed, or contrary to their principles, though he had been offered the throne, he would not have regarded it; though there had been yoked for him a thousand teams of horses, he would not have looked at them. In any matter contrary to the righteousness which they prescribed, or contrary to their principles, he would neither have given nor taken a single straw. Tang sent persons with presents of silk to entreat him to enter his service. With an air of indifference and self-satisfaction he said, "What can I do with those silks with which Tang invites me? Is it not best for me to abide in the channelled fields, and so delight myself with the principles of Yao and Shun?" Tang thrice sent messengers to invite him. After this, with the Zhange of resolution displayed in his countenance, he spoke in a different style, "Instead of abiding in the channelled fields and thereby delighting myself with the principles of Yao and Shun, had I not better make this prince a prince like Yao or Shun, and this people like the people of Yao or Shun? Had I not better in my own person see these things for myself? "Heaven's plan in the production of mankind is this: that they who are first informed should instruct those who are later in being informed, and they who first apprehend principles should instruct those who are slower to do so. I am one of Heaven's people who have first apprehended; I will take these principles and instruct this people in them. If I do not instruct them, who will do so?" He thought that among all the people of the kingdom, even the private men and women, if there were any who did not enjoy such benefits as Yao and Shun conferred, it was as if he himself pushed them into a ditch. He took upon himself the heavy charge of the kingdom in this way, and therefore he went to Tang, and pressed upon him the subject of attacking Xia and saving the people. I have not heard of one who bent himself, and at the same time made others straight; how much less could one disgrace himself, and thereby rectify the whole kingdom? The actions of the sages have been different. Some have kept remote from court, and some have drawn near to it; some have left their offices, and some have not done so - that to which those different courses all agree is simply the keeping of their persons pure. I have heard that Yi Yin sought an introduction to Tang by the doctrines of Yao and Shun. I have not heard that he did so by his knowledge of cookery. In the "Instructions of Yi," it is said, "Heaven destroying Jie commenced attacking him in the palace of Mu. I commenced in Bo."'
